# OhMyZsh Plugins
ohmyzsh/ohmyzsh path:plugins/aliases
ohmyzsh/ohmyzsh path:plugins/asdf
ohmyzsh/ohmyzsh path:plugins/bun
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/dnf
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/dotenv
ohmyzsh/ohmyzsh path:plugins/dotnet
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
ohmyzsh/ohmyzsh path:plugins/gh
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/globalias
ohmyzsh/ohmyzsh path:plugins/gradle
ohmyzsh/ohmyzsh path:plugins/lol
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/pyenv
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/qrcode
ohmyzsh/ohmyzsh path:plugins/rsync
ohmyzsh/ohmyzsh path:plugins/safe-paste
ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/stack
ohmyzsh/ohmyzsh path:plugins/systemd
ohmyzsh/ohmyzsh path:plugins/themes
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/vscode
ohmyzsh/ohmyzsh path:plugins/web-search
ohmyzsh/ohmyzsh path:plugins/yarn

# Completion only
ohmyzsh/ohmyzsh path:plugins/docker kind:fpath
ohmyzsh/ohmyzsh path:plugins/fd kind:fpath
ohmyzsh/ohmyzsh path:plugins/httpie kind:fpath
ohmyzsh/ohmyzsh path:plugins/pipenv kind:fpath
ohmyzsh/ohmyzsh path:plugins/ripgrep kind:fpath
ohmyzsh/ohmyzsh path:plugins/rust kind:fpath

# plugins beyond ohmyzsh
# Expands abbreviations when space is pressed
olets/zsh-abbr kind:defer
# Replaces zsh's autocomplete with fzf
Aloxaf/fzf-tab
# A simple plugin that auto-closes, deletes and skips over matching delimiters in zsh intelligently. Hopefully.
hlissner/zsh-autopair
# Switches python virtualenvs automatically
MichaelAquilina/zsh-autoswitch-virtualenv
# https://github.com/ChrisPenner/session-sauce
ChrisPenner/session-sauce

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search
# Better ls
zpm-zsh/ls

zsh-users/zsh-completions
